InformationRegisters/Renault_СтатусыЗаказовПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_СтатусыЗаказовПоставщику</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_СтатусыЗаказаПоставщику</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_НастройкиОбменаССайтом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_НастройкиОбменаССайтом</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодСклада</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлагСуммирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DMD</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_ПользователиИШаблоныПравИНастроек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ПользователиИШаблоныПравИНастроек</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПраваИНастройки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ПраваИНастройкиПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/Renault_СтатусыЗаказаПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Renault_СтатусыЗаказаПоставщику</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/Renault_ЗапчастиКлиентСервер/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ПОДПИСОК НА СОБЫТИЯ

Процедура Renault_ЗаказПоставщикуПриЗаписиСтатусПриЗаписи(Источник, Отказ) Экспорт

    Если НЕ Отказ Тогда

        МенеджерЗаписи = РегистрыСведений.Renault_СтатусыЗаказовПоставщику.СоздатьМенеджерЗаписи();
        МенеджерЗаписи.ЗаказПоставщику = Источник.Ссылка;
        МенеджерЗаписи.Прочитать();

        Если Не МенеджерЗаписи.Выбран() Тогда // Делаем новую запись
            МенеджерЗаписи.ЗаказПоставщику = Источник.Ссылка;
            МенеджерЗаписи.Статус          = Перечисления.Renault_СтатусыЗаказаПоставщику.Новый;
            МенеджерЗаписи.Записать(Истина);
        КонецЕсли;

    КонецЕсли;

КонецПроцедуры


Функция ЗаказОтправленВРено(ЗаказСсылка) Экспорт

    Запрос = Новый Запрос;
    Запрос.УстановитьПараметр("ЗаказПоставщику", ЗаказСсылка);
    Запрос.УстановитьПараметр("СтатусНового",    Перечисления.Renault_СтатусыЗаказаПоставщику.Новый);

    Запрос.Текст = "ВЫБРАТЬ
                   |    Renault_СтатусыЗаказовПоставщику.ЗаказПоставщику,
                   |    Renault_СтатусыЗаказовПоставщику.Статус
                   |ИЗ
                   |    РегистрСведений.Renault_СтатусыЗаказовПоставщику КАК Renault_СтатусыЗаказовПоставщику
                   |ГДЕ
                   |    Renault_СтатусыЗаказовПоставщику.ЗаказПоставщику = &ЗаказПоставщику
                   |    И НЕ Renault_СтатусыЗаказовПоставщику.Статус = &СтатусНового";

     Возврат Не Запрос.Выполнить().Пустой();

КонецФункции


Функция НайтиДилераРПартс(DMD) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("DMD", DMD);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Renault_НастройкиОбменаССайтом.ДилерскийЦентр
	               |ИЗ
	               |	РегистрСведений.Renault_НастройкиОбменаССайтом КАК Renault_НастройкиОбменаССайтом
	               |ГДЕ
	               |	Renault_НастройкиОбменаССайтом.DMD = &DMD";
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Возврат Результат.Выгрузить()[0].ДилерскийЦентр;
	Иначе
		Возврат Справочники.CRM_ДилерскиеЦентры.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ПРАВА И НАСТРОЙКИ

Функция ЕстьПравоАРМЗапчастиСнабжение() Экспорт

    Запрос = Новый Запрос;
    Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.Пользователь);
    Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
                   |    Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ЗЧ_АРМСнабжение КАК Право
                   |ИЗ
                   |    РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
                   |ГДЕ
                   |    Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь";
    Выборка = Запрос.Выполнить().Выбрать();

    Если Выборка.Следующий() Тогда
        Возврат Выборка.Право;

    Иначе
        Возврат Истина;

    КонецЕсли;

КонецФункции

Функция ЕстьПравоАРМЗапчастиСклад() Экспорт

    Запрос = Новый Запрос;
    Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.Пользователь);
    Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
                   |    Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ЗЧ_АРМСклад КАК Право
                   |ИЗ
                   |    РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
                   |ГДЕ
                   |    Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь";
    Выборка = Запрос.Выполнить().Выбрать();

    Если Выборка.Следующий() Тогда
        Возврат Выборка.Право;

    Иначе
        Возврат Истина;

    КонецЕсли;

КонецФункции

Функция ЕстьПравоАРМЗапчастиРеноПартс() Экспорт

    Запрос = Новый Запрос;
    Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.Пользователь);
    Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
                   |    Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ЗЧ_АРМРеноПартс КАК Право
                   |ИЗ
                   |    РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
                   |ГДЕ
                   |    Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь";
    Выборка = Запрос.Выполнить().Выбрать();

    Если Выборка.Следующий() Тогда
        Возврат Выборка.Право;

    Иначе
        Возврат Истина;

    КонецЕсли;

КонецФункции

Функция ЕстьПравоАРМЗапчастиРекламации() Экспорт

    Запрос = Новый Запрос;
    Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.Пользователь);
    Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
                   |    Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ЗЧ_АРМРекламации КАК Право
                   |ИЗ
                   |    РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
                   |ГДЕ
                   |    Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь";
    Выборка = Запрос.Выполнить().Выбрать();

    Если Выборка.Следующий() Тогда
        Возврат Выборка.Право;

    Иначе
        Возврат Истина;

    КонецЕсли;
КонецФункции

Функция ЕстьПравоАРМЗапчастиРеализации() Экспорт

    Запрос = Новый Запрос;
    Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.Пользователь);
    Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
                   |    Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ЗЧ_АРМРеализации КАК Право
                   |ИЗ
                   |    РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
                   |ГДЕ
                   |    Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь";
    Выборка = Запрос.Выполнить().Выбрать();

    Если Выборка.Следующий() Тогда
        Возврат Выборка.Право;

    Иначе
        Возврат Истина;

    КонецЕсли;
КонецФункции

Функция ПолучитьПраваАРМЗапчасти() Экспорт

    Запрос = Новый Запрос;
    Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.Пользователь);
    Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
                   |    Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ЗЧ_АРМКаталог КАК Каталог,
                   |    Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ЗЧ_АРМСнабжение КАК Снабжение,
                   |    Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ЗЧ_АРМСклад КАК Склад,
                   |    Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ЗЧ_АРМРеноПартс КАК РеноПартс,
                   |    Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ЗЧ_АРМРекламации КАК Рекламации,
                   |    Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ЗЧ_АРМКладовщика КАК АРМКладовщика,
                   |    Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ЗЧ_АРМЛогиста КАК АРМЛогиста,
				   |    Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ЗЧ_АРМРеализации КАК АРМРеализации
                   |ИЗ
                   |    РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
                   |ГДЕ
                   |    Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь";
    Выборка = Запрос.Выполнить().Выбрать();

    Ответ = Новый Структура("Каталог, Снабжение, Склад, РеноПартс, Рекламации, АРМКладовщика, АРМЛогиста, АРМРеализации",
                            Истина, Истина, Истина, Истина, Истина, Истина, Истина, Истина);

    Если Выборка.Следующий() Тогда
        ЗаполнитьЗначенияСвойств(Ответ, Выборка);
    КонецЕсли;

    Возврат Ответ;

КонецФункции
